# This is a tutorial

## Libraries

In [183]:
import pandas as pd
import numpy as np
import seaborn as sns #pip install seaborn
import matplotlib.pyplot as plt
from IPython.display import display, HTML #pip install ipython

## Step 1: Data Collection
In this step, we will gather interested data to explore. <br>
Source links: (for the csv files, check out this repository...)<br>
[1]https://ourworldindata.org/child-maltreatment-and-educational-outcomes <br>
[2]https://www.kaggle.com/datasets/jessemostipak/college-tuition-diversity-and-pay <br>
[3]https://nces.ed.gov/programs/coe/indicator/cpbcollege-enrollment-rate#:~:text=The%20overall%20college%20enrollment%20rate%20of%2018%2D%20to%2024%2Dyear,%2D%20or%204%2Dyear%20institutions <br>
[4]https://www.kaggle.com/datasets/shariful07/student-mental-health <br>
[5]https://archive-beta.ics.uci.edu/dataset/697/predict+students+dropout+and+academic+success <br>
[6]https://www.cdc.gov/sleep/data-and-statistics/high-school-students.html <br>
[7]https://nces.ed.gov/programs/coe/indicator/a01/violent-deaths-and-shootings <br>
[8]https://research.com/education/college-drug-abuse-statistics <br>

In [184]:
df_children_work = pd.read_csv('working-children-out-of-school-ages-7-14-vs-hours-worked-by-children-ages-7-14.csv')
df_usa_salary_potential = pd.read_csv('usa_salary_potential.csv')
df_usa_college_enroll_rate = pd.read_csv('usa_college_enroll_rate.csv')
df_usa_college_enroll_rate_enthnicity = pd.read_csv('usa_college_enroll_rate_ethnicity.csv')
df_malaysia_student_mental_health = pd.read_csv('malaysia_student_mental_health.csv')
df_usa_highschool_sleep_trends = pd.read_csv('usa_highschool_sleep_trends.csv')
df_usa_youth_violence_history = pd.read_csv('usa_youth_violence_history.csv')
df_drug_abuse_reasons = pd.read_csv('drug_abuse_top_reasons.csv')
df_europe_students = pd.read_csv('europe_college_student_data.csv', sep=';')

In [185]:
#If you want to see the whole table without the '...', you can use the following.
#pd.set_option('display.max_columns', None)  # Show all columns
#pd.set_option('display.max_rows', None)     # Show all rows

#If this is too much data, you can reset back to default (recommended).
#pd.reset_option('display.max_columns')
#pd.reset_option('display.max_rows')

def showTable(df, name):
    display(HTML(f"<div style='text-align:center;'><h4>{name}</h4></div>"))
    display(df.head(10))

Brief: Children working hours...

In [186]:
#showTable(df_children_work, 'Working children out of school vs. hours worked by children (age 7-14)')

Brief: Perhaps money is one thing that attracts people to go to universities. It is one of the motivations that drive students to persue higher education. add more...

In [187]:
#showTable(df_usa_salary_potential, 'Potential Salary for College Graduates (USA)')

Brief: We would like to see college enrollment rate and enthnicity rate because knowing this could help us understand more about students' identity and see part of the college environment. Since the United States is a culturally diverse country, student diversity will be an interesting factor to consider. You can exlpore more details on your own.

In [188]:
#showTable(df_usa_college_enroll_rate, 'USA College Enroll Rate 2010 - 2021 for ages 18 to 24')
#showTable(df_usa_college_enroll_rate_enthnicity, 'USA College Enroll Rate 2010 - 2021 Ethnicity ages 18 to 24')

Brief: While students are in school, mental health could be an issue. Maybe it is because they want to work hard to get a good job, or to achieve something. The stress level in different courses could be an indicator of this. Here, we found data from International Islamic University Malaysia in year 2020 to show case this. (We are interested in age, course, and mental state.)

In [189]:
#showTable(df_malaysia_student_mental_health, 'Student Mental Health in International Islamic University Malaysia in year 2020')

Brief: For high school students, we decided to look into their sleep data in the U.S to see if the sleep data can tell us something. Of course, without other additional data, we cannot make conclusions about how sleep can make a student success or do not so good in their education. However, our goal is to see the big trend. For details about this kind of topic, you can explore the reasons behind it.

In [190]:
#showTable(df_usa_highschool_sleep_trends, 'National trends in short sleep duration among US high school students, 2009–2019')

Brief: We would also like to explore the violence from age 5 to 18. While the datasets for mental health and violence we have here are completely different from each other, we thought that since violence will get announced and spread across media, like school shootings in the U.S, so people might get worried or panic. From the statistic point of view, this dataset from the National Center for Education could let us see the number of violences. From the emotion point of view, we could 'start' to see students' view of violence. For more details, you would need to explore on your own.

In [191]:
#showTable(df_usa_youth_violence_history, 'Violent Deaths at School and Away From School and School Shootings in USA (age 5-18)')

Brief: Drug abuse. This is a direct cause to education performance in common sense. Because it became common sense, we would like to know why. Here is a student dataset from the University of Sao Paulo to show this.

In [192]:
#showTable(df_drug_abuse_reasons, 'Common Reasons for Drug Abuse')

Brief: Europe students...

In [193]:
#showTable(df_europe_students, 'Europe College Student Info')

Still alive? Keep reading.

## Step 2: Data Processing
Many times, the data we got is messy. In this process, we will clean some data. Check for NaN values and duplicate rows first. Drop uneccessary columns, and maybe change the column name if needed.

In [194]:
#df.columns
def peekData(df):
    print('---------------------------------------------------')
    print('Table NaN values count for each column\n') 
    print(df.isna().sum(), '\n')
    print('Table duplicated rows count', df.duplicated().sum(), '\n')
    print('---------------------------------------------------')

In [195]:
peekData(df_children_work)

---------------------------------------------------
Table NaN values count for each column

Entity                                                                               0
Code                                                                              3281
Year                                                                                 0
Children in employment, work only (% of children in employment, ages 7-14)       57865
Average working hours of children, study and work, ages 7-14 (hours per week)    58015
Population (historical estimates)                                                   48
Continent                                                                        57862
dtype: int64

Table duplicated rows count 0

---------------------------------------------------

Observed: For the children work dataset, there are quite a lot of NaN values, so doing something like imputation won't work. In this case, we are interested in Entity, year, population, and child work hours. So, we can drop the rows that has NaN values in these columns to then see what result we get. Also, the column name is too long, so we will shorten the name.

In [196]:
#Don't need Continent and Code column, drop it.
df_children_work.drop(columns=['Continent', 'Code'], inplace=True)

df_children_work.rename(
    columns={'Children in employment, work only (% of children in employment, ages 7-14)': 'Work_only_pct', 
             'Average working hours of children, study and work, ages 7-14 (hours per week)': 'Work_study(hrs/week)',
             'Population (historical estimates)' : 'Population'}, 
    inplace=True
)

df_children_work[(df_children_work['Year'] >= 1999) & (df_children_work['Year'] <= 2016)]

df_children_work = df_children_work.dropna(subset=['Work_only_pct', 'Work_study(hrs/week)', 'Population'])

#if you want to double check, uncomment this line.
#peekData(df_children_work) 

df_children_work

            Entity  Year  Work_only_pct  Work_study(hrs/week)  Population
1      Afghanistan  2011      50.000000              13.10000  29249156.0
598        Albania  2010       5.100000              13.60000   2913402.0
855        Algeria  2013       4.508655               3.60000  38000628.0
1487        Angola  2001      26.600000              12.50000  16941584.0
2389       Armenia  2010       0.000000               5.40000   2946296.0
...            ...   ...            ...                   ...         ...
56267    Venezuela  2006      19.844778              21.30000  27102084.0
56268    Venezuela  2013      31.134620              16.28939  29838022.0
56526      Vietnam  2012      19.000000              11.60000  89301328.0
57245        Yemen  2010      35.970116              16.90000  24743944.0
57629       Zambia  2008      18.575392               4.20000  12852968.0

[132 rows x 5 columns]

In [197]:
peekData(df_usa_salary_potential)

---------------------------------------------------
Table NaN values count for each column

rank                          0
name                          0
state_name                    0
early_career_pay              0
mid_career_pay                0
make_world_better_percent    33
stem_percent                  0
dtype: int64

Table duplicated rows count 1

---------------------------------------------------

Observed: For the USA college graduate postential salary, we care about the pay, so we will drop the irrelevant column "make_world_better_percent".

In [198]:
df_usa_salary_potential = df_usa_salary_potential.drop(columns=['make_world_better_percent'])
df_usa_salary_potential = df_usa_salary_potential.drop_duplicates(keep='last') #keep only one of the duplicated rows.
df_usa_salary_potential

,rank,name,state_name,early_career_pay,mid_career_pay,stem_percent
0,1,Auburn University,Alabama,54400,104500,31
1,2,University of Alabama in Huntsville,Alabama,57500,103900,45
2,3,The University of Alabama,Alabama,52300,97400,15
3,4,Tuskegee University,Alabama,54500,93500,30
4,5,Samford University,Alabama,48400,90500,3
...,...,...,...,...,...,...
930,22,Viterbo University,Wisconsin,46800,81900,3
931,23,Concordia University-Wisconsin,Wisconsin,46700,81600,9
932,24,University of Wisconsin-Parkside,Wisconsin,46000,81400,17
933,25,University of Wisconsin-River Falls,Wisconsin,47100,81300,14
934,1,University of Wyoming,Wyoming,52400,98800,25

In [199]:
peekData(df_usa_college_enroll_rate)
peekData(df_usa_college_enroll_rate_enthnicity)

---------------------------------------------------
Table NaN values count for each column

Year                      0
Total                     2
Total-Standard Error      2
2-year                    2
2-year-Standard Error     2
4-year                    2
4-year-Standard Error     2
Unnamed: 7               14
dtype: int64

Table duplicated rows count 0

---------------------------------------------------
---------------------------------------------------
Table NaN values count for each column

Race/ethnicity          0
2010                    2
2010-Standard Error     2
2021                    2
2021-Standard Error     2
Unnamed: 5             10
dtype: int64

Table duplicated rows count 0

---------------------------------------------------

From the table, we will get rid of the NaN values and then the last 2 rows (we can see why from Step 1 Data Collection). The column names look clean and the overall table is small. Easy to process :)

In [200]:
df_usa_college_enroll_rate_enthnicity = df_usa_college_enroll_rate_enthnicity.copy()
df_usa_college_enroll_rate = df_usa_college_enroll_rate.iloc[:-2, :-1] #get rid of last 2 rows and last column
df_usa_college_enroll_rate_enthnicity = df_usa_college_enroll_rate_enthnicity.iloc[:-2, :-1]

#uncomment to double check
#df_usa_college_enroll_rate
#df_usa_college_enroll_rate_enthnicity

In [201]:
peekData(df_europe_students)

---------------------------------------------------
Table NaN values count for each column

Marital status                                    0
Application mode                                  0
Application order                                 0
Course                                            0
Daytime/evening attendance                        0
Previous qualification                            0
Previous qualification (grade)                    0
Nacionality                                       0
Mother's qualification                            0
Father's qualification                            0
Mother's occupation                               0
Father's occupation                               0
Admission grade                                   0
Displaced                                         0
Educational special needs                         0
Debtor                                            0
Tuition fees up to date                           0
Gender                                            0
Scholarship holder                                0
Age at enrollment                                 0
International                                     0
Curricular units 1st sem (credited)               0
Curricular units 1st sem (enrolled)               0
Curricular units 1st sem (evaluations)            0
Curricular units 1st sem (approved)               0
Curricular units 1st sem (grade)                  0
Curricular units 1st sem (without evaluations)    0
Curricular units 2nd sem (credited)               0
Curricular units 2nd sem (enrolled)               0
Curricular units 2nd sem (evaluations)            0
Curricular units 2nd sem (approved)               0
Curricular units 2nd sem (grade)                  0
Curricular units 2nd sem (without evaluations)    0
Unemployment rate                                 0
Inflation rate                                    0
GDP                                               0
Target                                            0
dtype: int64

Table duplicated rows count 0

---------------------------------------------------

Observed: Good. For the Europe Student dataset, there is no need to clean the data.

## Step 3: Exploratory Data Analysis(EDA) & Visualization

The data for children work may not be perfect to visualize. However, let's first see the overall view, and then do a scatter plot.

In [202]:
df_children_work = df_children_work.sort_values(by='Year')
#display(df_children_work)
print('Children age 7-14 working years to visualize:', df_children_work['Year'].unique())
display(df_children_work.describe())

Children age 7-14 working years to visualize: [1999 2000 2001 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015
 2016]

              Year  Work_only_pct  Work_study(hrs/week)    Population
count   132.000000     132.000000             132.00000  1.320000e+02
mean   2010.515152      21.194017              13.61419  3.247172e+07
std       3.554343      18.363822               7.41143  5.065799e+07
min    1999.000000       0.000000               1.90000  1.019369e+06
25%    2009.000000       6.539222               8.37500  5.986888e+06
50%    2011.000000      17.528625              13.05000  1.237385e+07
75%    2013.000000      32.422263              16.50000  2.939637e+07
max    2016.000000      89.345680              40.30000  2.440162e+08